DinnerParty/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "password", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "AUserName"], ["password", "testtest"], ["name", "Joshua Denenberg"], ["created_at", "2017-10-23 18:02:40.551070"], ["updated_at", "2017-10-23 18:02:40.551070"]]