app/views/users/show.html.erb

SELECT "recipes".* FROM "recipes" INNER JOIN "userrecipes" ON "recipes"."id" = "userrecipes"."recipe_id" WHERE "userrecipes"."user_id" = ?  [["user_id", 1]]
---
  <ul>
    <% @user.recipes.each do |recipe|%>